{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "dtype": "float32", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_1", "batch_input_shape": [null, 24, 24, 1], "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 24, "dilation_rate": [1, 1], "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_4", "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.25, "trainable": true, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "name": "dense_1", "units": 512, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "name": "dense_2", "units": 1, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_6"}}], "backend": "tensorflow", "keras_version": "2.0.4"}