{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 24, 24, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "name": "conv2d_1", "data_format": "channels_last", "bias_regularizer": null, "filters": 32, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": null, "filters": 24, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "trainable": true, "name": "conv2d_4", "data_format": "channels_last", "bias_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 512, "kernel_constraint": null, "name": "dense_1", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 1, "kernel_constraint": null, "name": "dense_2", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_6", "trainable": true}}]}