{"keras_version": "2.0.4", "backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "batch_input_shape": [null, 60, 60, 1], "trainable": true, "dtype": "float32", "padding": "valid", "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "padding": "valid", "filters": 32, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "conv2d_3", "bias_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "trainable": true, "activity_regularizer": null, "padding": "valid", "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "units": 512, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "units": 1, "activity_regularizer": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential"}